Revit 2026 API

# DocumentNewRoom(Level, UV) Method

---

Creates a new room on a level at a specified point.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Room NewRoom(
	Level level,
	UV point
)
```
```vb
Public Function NewRoom (
	level As Level,
	point As UV
) As Room
```
```cpp
public:
Room^ NewRoom(
	Level^ level,
	UV^ point
)
```
```fsharp
member NewRoom :
        level : Level *
        point : UV -> Room
```

#### Parameters

level Level
     The level on which the room is to exist.
point UV
     A 2D point that dictates the location of the room on that specified level.

#### Return Value

Room If successful the new room will be returned, otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if the level does not exist in the given document. |

This method will regenerate the document even in manual regeneration mode.

#### Reference

Document Class

NewRoom Overload

Autodesk.Revit.Creation Namespace